//! Модули позволяют структурировать код, другими словами проект делится на логические части, которые отдельно пишутся, а потом собираются в один код посредством импортирования

//* Так же они помогают избегать дублирования кода

//! EXPORT/IMPORT синтаксис появился в ES6
//* каждый файл JavaScript является отдельным модулем, из которого мы можем экспортировать часть переменных из такого модуля/файла или импортировать, что позволяет использовать переменную из одного файла в функции другого файла. Таким образом мы связываем все файлы/модули в один проэкт

//? Для импорта надо